Revit 2027 API
SolidSolidCutUtils.GetSolidsBeingCut Method
 Get all the solids which are cut by the input element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetSolidsBeingCut(
	Element element
)
Public Shared Function GetSolidsBeingCut (
	element As Element
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetSolidsBeingCut(
	Element^ element
)
static member GetSolidsBeingCut :
        element : Element -> ICollection<ElementId>
Parameters
element Element
 The input element.
Return Value
ICollection<ElementId>
 The ids of the solids which are cut by the input element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SolidSolidCutUtils Class
Autodesk.Revit.DB Namespace